[
  {
    "original_content": "Chapter: General\nSection: IIMA- BRIEF NOTE\nContent: Indian Institute of Management, Ahmedabad [IIMA], was set up by the Government of India in collaboration with the Government of Gujarat and local industrialists as an autonomous Institute in 1961. IIMA has been conceived not only as a business school but also as a management institute. IIMA builds on over five decades of excellence and leadership in management education. IIMA has been rated as India’s best and Asia’s foremost Business School. IIMA continues to be ranked as one of the finest institutions in the world in management education, with an academic rigour that matches the top league. With a distinguished faculty, an exceptional student-faculty ratio, and a 100-acre world-class campus conducive to continuous learning, IIMA is an Institute that sets international standards in the field of management education. IIMA, is a pioneer of the case study approach to management education in India, the result of its early collaboration with Harvard Business School. A student-centred methodology entails working in groups and encourages intense participation, as students learn to present their perspectives, defend their stand, and think through management problems. The Institute stands for excellence in management education. Since its inception, IIMA has contributed to the development of management thought in India through its research and teaching.  In 2008, IIMA became the first management school in the country to be awarded EQUIS (European Quality Improvement System) accreditation by the EFMD (European Foundation for Management Development). The Institute conducts the following major programmes: 1. Two-year Post Graduate Programme in Management (MBA). 2. Two-year Post Graduate Programme in Food and Agri-business Management (MBA - FABM). 3. Ph.D. Programme in Management. 4. One-year Post Graduate Programme in Management for Executives (MBA - PGPX). 5. Faculty Development Programme for Teachers in Universities and Colleges (FDP). 6. Armed Forces Programme for Officers for Indian Armed Forces (AFP). 7. Two year ePost Graduate Programme (ePGP). 8. Sixteen months ePost Graduate Diploma in Advanced Business Analytics (ePGD - ABA) CHAPTER 1 GENERAL 2 IIMA HR Policy Manual 2023 9. Executive Education Programme - India 10.\t Executive Education Programme - Dubai At IIMA, it is a tradition to continually update the course content, revise the course design, and experiment with innovative pedagogy. The faculty at IIMA continuously attempt to integrate research, teaching and applied work. Pedagogical tools create a participative learning environment. While the case method is the major tool, it is supplemented by group exercises, computer-based simulation games, lecture-cum-discussions, role plays, project works and presentations by participants.",
    "structured_summary": "## IIMA HR Policy Manual 2023\n### General\n\nIIMA, established in 1961, is an autonomous Institute in collaboration with the Government of India, Gujarat, and local industrialists. It's rated as India's best and Asia's foremost Business School, ranking among the world's finest institutions in management education.\n\n### Eligibility Criteria\nNo specific eligibility criteria mentioned.\n\n### Policy Rules & Clauses\n- IIMA builds on five decades of excellence and leadership in management education.\n- The Institute conducts various programs, including MBA, MBA - FABM, Ph.D., MBA - PGPX, FDP, AFP, e PGP, e PGD - ABA, and Executive Education Programs.\n\n### Exceptions or Director’s Discretion\nNo specific exceptions or director's discretion mentioned.\n\n### Usage Conditions and Penalties\nNo usage conditions or penalties mentioned.\n\n### License or Housing Agreements\nNo license or housing agreements mentioned.\n\n### Fee Tables or Annexures\n#### Fee Structure\n\n| Program | Duration | Fee |\n| --- | --- | --- |\n| MBA | 2 years | [REDACTED] |\n| MBA - FABM | 2 years | [REDACTED] |\n| Ph.D. | - | [REDACTED] |\n| MBA - PGPX | 1 year | [REDACTED] |\n| FDP | - | [REDACTED] |\n| AFP | - | [REDACTED] |\n| e PGP | 2 years | [REDACTED] |\n| e PGD - ABA | 16 months | [REDACTED] |\n| Executive Education Programs | - | [REDACTED] |",
    "metadata": {
      "page_range": "11-12",
      "chapter_title": "General",
      "source": "hr_document",
      "content_type": "policy",
      "chapter_id": "Chapter 1",
      "type": "subtopic",
      "subtopic_title": "IIMA- BRIEF NOTE",
      "summary_stats": {
        "original_words": 415,
        "summary_words": 233,
        "compression_ratio": 0.5614457831325301
      }
    },
    "privacy_redacted": true,
    "processing_successful": true,
    "doc_id": "General_THE_YEARS_OF_TRANSFORMATION"
  },
  {
    "original_content": "Chapter: General\nSection: THE YEARS OF TRANSFORMATION\nContent: 1960s - THE DECADE OF BIRTH IIMA rises beyond the acquisition of knowledge, techniques, tools, and concepts that are not ends in themselves. • Focus on social purpose while pursuing excellence in management • Integration of key activities like teaching, research, and consultancy • Introduction of the 3-Tier Management Development Programme 1970s- THE DECADE OF GROWTH The Institute gains broader recognition. • Overall growth in all activities • Increase in the faculty strength to 65 • Increase in the number of participants in the Post-Graduate Programme • Launch of the Fellowship (Doctoral) Programme in Management • Introduction of new Management Development Programmes 1980s - THE DECADE OF DIVERSIFICATION Recognised as the premier management school throughout the country, the Institute expands its range and reach. • Greater focus on under-managed sectors • Formation of three new groups: The Industrial Policy Management Group, The International Management Group, and The Entrepreneurship Group • Introduction of Faculty Development Programme 1990s - THE DECADE OF CONSOLIDATION Taking into account the substantial growth of the previous decades, the Institute focuses on consolidating its activities and position. • Substantial growth in the IT infrastructure of the Institute with a campus-wide intranet and leased line access to the Internet • Recognition as one of the top five business schools in the Asia Pacific region • Exchange of students with reputable business schools abroad 3 IIMA HR Policy Manual 2023 2000 - THE DECADE OF INTERNATIONALISATION Internationalisation and growth are the keywords of the Institute during this decade. • Exchange of faculty with international business schools • Further, an increase in student intake with an emphasis on admitting full-time international students • Expansion of the campus to accommodate the Institute’s international executive development programmes 2010 - THE DECADE OF DIGITIZATION From the world of brick and mortar, the Institute has moved to the digital platform. • Starting a new era of e-learning through ePGP course • Giving more flexibility to students to attend classes from any of the major cities of India. • It’s a new-age learning experience where knowledge empowered by technology. • Phase wise implementation of SAP in various departments of the Institute. THE IIM ACT, 2017, IIM RULES, 2018 AND IIM (AMENDMENT) RULES, 2022 The IIM Act, 2017 has declared all the IIMs to be institutions of national importance and empowered them to attain standards of global excellence in management, management research and allied areas of knowledge. The Act has specifically descried the various authorities of the Institute, their powers, its constitution, tenure of the members etc. The IIM Rules, 2018 and IIM (Amendment) Rules, 2022 describes the appointment process, terms and conditions of the Chairperson, the members of the board and the Director. 4 IIMA HR Policy Manual 2023 The governing structure of IIMA is presented in a tabular format below. BOARD OF GOVERNORS DIRECTOR DEAN (PROGRAMMES) DEAN (FACULTY) DEAN, ALUMNI & EXTERNAL RELATIONS FACULTY Chief Administrative Officer Admission Post Graduate Programme (MBA) Post Graduate Programme in Food & Agri-Business Management (MBA-FABM) Post Graduate Programme in Management for Executive (MBA-PGPX) Ph.D. Programme in Management Faculty Dev. Programme (FDP) Armed Forces Programme (AFP) e-Mode Post Graduate Programme Executive Education Programme Placement Accreditation and Ranking Student Housing, Activities, and Welfare Strategy Area Information Systems Area Communication Area Finance & Accounting Area Marketing Area Organizational Behaviour Area Human Resources Management Area Production Quantitative Methods Area Public Systems Group Ravi J. Matthai Centre for Education Innovation Economics Area Centre for Management in Agriculture (CMA) Alumni Relations Human Resource Publications Dispensary Finance & Budgets Stores & Purchase Office Secretarial Staff Facilities Contracts Hindi Cell Engineering and Projects Engineering Services Estate Security House Keeping Horticulture Transport Compliance Library India Gold Policy Ctr. Case Centre Communication Vikalpa Res. & Publication CIIE ICT Ashank Desai Ctr. for L&OD Gender Centre JSW SPP CMHS Inf. Center/Dispatch IIMA Archives International Partnerships e-Post Graduate Diploma in Advanced Business Analytics (ePGD-ABA) Chief Financial Officer Accounts Ctr. for Dig Trfm. Ctr for Tptn. & Log. MCFME NSE Centre Brij Disa Ctr. for DS&AI Vigilance Duggal ESG Ctr. Electrical and Mechanical CSC 5 IIMA HR Policy Manual 2023 Board of Governors of IIMA Sr. No. Name and Address Designation 1. Shri Pankaj R. Patel Chairman Zydus Lifesciences Limited Zydus Corporate Park, Nr. Vaishnodevi Circle, S.G. Highway, Ahmedabad 382 481. Chairperson 2. Shri P.K. Banerjee, ISS (1993), Joint Secretary (Mgt. & MC & Scholarship) Ministry of Education Department of Higher Education Room No. 230 C, 2nd Floor, C Wing, Shastri Bhawan, New Delhi 110 001 Nominee of Central Government 3. Shri S J Haider Principal Secretary (Higher & Technical Education) Education Department Government of Gujarat Block No.5, 8th Floor Sardar Bhavan New Sachivalaya Complex Gandhinagar 382 010 Nominee of State Government 4. Shri Sunil Kant Munjal Chairman The Hero Enterprise 264, Okhla Industrial Estate Phase 3 New Delhi 110 020 Eminent Persons 5. Ms. Alka Bharucha Partner Bharucha & Partners Hague Building 9, S.S. Ram Gulam Marg, Ballard Estate, Mumbai 400 001 -do- 6. Ms. Kaku Nakhate President & Country Head (India) Bank of America, N.A. 18th Floor, A Wing, One BKC Bandra Kurla Complex Bandra (East), Mumbai 400051 -do- 7. Shri Sanjiv Dangi North India President Dalit Indian Chamber of Commerce & Industry (DICCI) A-178, Pandara Road New Delhi 110003 -do- 6 IIMA HR Policy Manual 2023 8. Prof. Ajay Pandey IIM Ahmedabad Chairman’s Nominee 9. Prof. Sachin Jayaswal IIM Ahmedabad Chairman’s Nominee 10. Ramesh Mangaleswaran Senior Partner Emeritus, McKinsey & Company Chennai, Tamil Nadu, India Co-opted by the Board from the Alumni 11. Dr. Hasit Joshipura Advisor to L&T Group CEO and MD, Data Centre & Cloud, Innovation Fund Larsen & Toubro Limited Landmark A Wing, 5th Floor, Suren Road Off. Andheri-Kurla Road Andheri (East), Mumbai – 400093 -do- 12. Rama Bijapurkar 206, Nirman Kendra, Dr. E. Moses Road, Mahalakshmi, Mumbai 400 011. -do- 13. Prof. Pradeep K. Chintagunta Joseph T. and Bernice S. Lewis Distinguished Service Professor of Marketing University of Chicago Booth School of Business Chicago, IL 60637, USA -do- 14. Samir U. Mehta Chairman, Torrent Group Torrent House, Off. Ashram Road, Ahmedabad – 380009 Co-opted by the Board from the members of Society 15. Prof. Errol D’Souza Director IIM Ahmedabad Ex-Officio Secretary: Col Amit Verma (Retd) Chief Administrative Officer Indian Institute of Management Ahmedabad 380 015",
    "structured_summary": "## IIMA HR Policy Manual 2023\n\n### General\n\nIIMA rises beyond the acquisition of knowledge, techniques, tools, and concepts that are not ends in themselves. Focus on social purpose while pursuing excellence in management. Integration of key activities like teaching, research, and consultancy. Introduction of the 3-Tier Management Development Programme.\n\n### Eligibility Criteria\n\nNo specific eligibility criteria mentioned.\n\n### Policy Rules & Clauses\n\nThe IIM Act, 2017 declares all IIMs to be institutions of national importance and empowers them to attain standards of global excellence in management, management research, and allied areas of knowledge. The IIM Rules, 2018 and IIM (Amendment) Rules, 2022 describe the appointment process, terms, and conditions of the Chairperson, members of the board, and the Director.\n\n### Exceptions or Director’s Discretion\n\nNo specific exceptions or director’s discretion mentioned.\n\n### Usage Conditions and Penalties\n\nNo specific usage conditions or penalties mentioned.\n\n### License or Housing Agreements\n\nNo license or housing agreements mentioned.\n\n### Fee Tables or Annexures\n\n| **Fee Structure** | **Description** |\n| --- | --- |\n| Post Graduate Programme (MBA) | [REDACTED] |\n| Post Graduate Programme in Food & Agri-Business Management (MBA-FABM) | [REDACTED] |\n| Post Graduate Programme in Management for Executive (MBA-PGPX) | [REDACTED] |\n| Ph.D. Programme in Management | [REDACTED] |\n| e-Mode Post Graduate Programme | [REDACTED] |\n| Executive Education Programme | [REDACTED] |\n\nNote: Fee structures and annexures have been redacted due to their sensitive nature.\n\n### Overstay Charges\n\nNo overstay charges mentioned.\n\n### Improper Use\n\nNo improper use mentioned.\n\n### Director's Overrides\n\nNo director's overrides mentioned.\n\n### Board of Governors\n\n| **Name and Address** | **Designation** |\n| --- | --- |\n| Shri Pankaj R. Patel | Chairman |\n| Shri P.K. Banerjee | Nominee of Central Government |\n| Shri S J Haider | Nominee of State Government |\n| Shri Sunil Kant Munjal | Eminent Person |\n| Ms. Alka Bharucha | Eminent Person |\n| Ms. Kaku Nakhate | Eminent Person |\n| Shri Sanjiv Dangi | Eminent Person |\n| Prof. Ajay Pandey | Chairman’s Nominee |\n| Prof. Sachin Jayaswal | Chairman’s Nominee |\n| Ramesh Mangaleswaran | Co-opted by the Board from the Alumni |\n| Dr. Hasit Joshipura | Advisor to L&T Group CEO and MD, Data Centre & Cloud, Innovation Fund |\n| Rama Bijapurkar | Co-opted by the Board from the members of Society |\n| Prof. Pradeep K. Chintagunta | Co-opted by the Board from the members of Society |\n| Samir U. Mehta | Co-opted by the Board from the members of Society |\n| Prof. Errol D’Souza | Ex-Officio Secretary: Col Amit Verma (Retd) |",
    "metadata": {
      "chapter_id": "Chapter 1",
      "subtopic_title": "THE YEARS OF TRANSFORMATION",
      "source": "hr_document",
      "page_range": "12-16",
      "content_type": "policy",
      "chapter_title": "General",
      "type": "subtopic",
      "summary_stats": {
        "original_words": 1049,
        "summary_words": 443,
        "compression_ratio": 0.4223069590085796
      }
    },
    "privacy_redacted": true,
    "processing_successful": true,
    "doc_id": "Recruitment_Policy_POST___MANAGER_&_ABOVE_"
  },
  {
    "original_content": "Chapter: Recruitment Policy\nSection: POST - MANAGER & ABOVE:\nContent: 1. OEDC Member 2. Dean 3. Chief Administrative Officer 4. Head of Department 5. Associate Vice President – HR 6. Any other expert or person if nominated by Director",
    "structured_summary": "## Recruitment Policy\n### Eligibility Criteria\n* OEDC Member\n* Dean\n* Chief Administrative Officer\n* Head of Department\n* Associate Vice President – HR\n* Any other expert or person if nominated by Director\n\n### Policy Rules & Clauses\n* [REDACTED]\n* [REDACTED]\n* [REDACTED]\n\n### Exceptions or Director’s Discretion\n* Director's nomination of additional experts\n\n### Usage Conditions and Penalties\n* [REDACTED]\n\n### License or Housing Agreements\n* [REDACTED]\n\n### Fee Tables or Annexures\n| Fee Category | Fee Amount |\n| --- | --- |\n| [REDACTED] | [REDACTED] |",
    "metadata": {
      "chapter_id": "Chapter 3",
      "chapter_title": "Recruitment Policy",
      "subtopic_title": "POST - MANAGER & ABOVE:",
      "source": "hr_document",
      "content_type": "policy",
      "type": "subtopic",
      "page_range": "20-20",
      "summary_stats": {
        "original_words": 39,
        "summary_words": 93,
        "compression_ratio": 2.3846153846153846
      }
    },
    "privacy_redacted": true,
    "processing_successful": true,
    "doc_id": "Recruitment_Policy_POST___BELOW_MANAGER_LEVEL_"
  },
  {
    "original_content": "Chapter: Recruitment Policy\nSection: POST - BELOW MANAGER LEVEL:\nContent: 1. SEDC member 2. Head of Department 3. Associate Vice President -HR 4. Nominated Person",
    "structured_summary": "## Recruitment Policy\n\n### Eligibility Criteria\n* SEDC member\n* Head of Department\n* Associate Vice President - HR\n* Nominated Person\n\n### Policy Rules & Clauses\n* [REDACTED] for [REDACTED]\n\n### Exceptions or Director’s Discretion\n* Director’s overrides for [REDACTED]\n\n### Usage Conditions and Penalties\n* [REDACTED]\n\n### License or Housing Agreements\n* [REDACTED]\n\n### Fee Tables or Annexures\n| Fee | Description |\n| --- | --- |\n| [REDACTED] | [REDACTED] |",
    "metadata": {
      "subtopic_title": "POST - BELOW MANAGER LEVEL:",
      "type": "subtopic",
      "chapter_id": "Chapter 3",
      "chapter_title": "Recruitment Policy",
      "page_range": "20-20",
      "source": "hr_document",
      "content_type": "policy",
      "summary_stats": {
        "original_words": 25,
        "summary_words": 75,
        "compression_ratio": 3.0
      }
    },
    "privacy_redacted": true,
    "processing_successful": true,
    "doc_id": "Recruitment_Policy_INTERVIEW_&_SELECTION_PROCESS"
  },
  {
    "original_content": "Chapter: Recruitment Policy\nSection: INTERVIEW & SELECTION PROCESS\nContent: 1. Personal Interviews will be fixed as per the convenience of the interview panel members. 2. Candidates shortlisted for test/interview will be notified about it by an email. This will be followed by a detailed call letter, which will be sent to them by post/courier. 3. The candidates will be directed to the venue for test/interview. Forms that are needed to be filled like qualification details etc, will be done at this stage. 4. The interview structure may involve skill test, personal interview, and/or group discussion/ debate/quiz. 5. HR department will ensure that after the interview, each of the panel members provide their feedback in writing about the performance of the candidates. 6. HR will also play an active role in salary negotiation & fixation. 7. The HR will collect feedback from references as needed. CONVEYANCE REIMBURSEMENT 1. For Manager and above position, economy air travel fare will be reimbursed. The air travel fare should be the shortest distance. 2. Candidates called for the position at Level 6 to Level 9 will be reimbursed train fare for AC 3-Tier and for all below levels, it will be train fare for Sleeper Class. The train travel fare reimbursement will be for shortest route. 3. Request for reimbursement should be submitted in the prescribed form by the Candidate. FINAL SELECTION Final selection is made upon acceptance of the selection committee’s recommendations.  The selected candidate is offered the position subject to clearance of medical examination. 11 IIMA HR Policy Manual 2023 MEDICAL EXAMINATION: For all the positions, the medical checkup can be performed by the doctor available at the Institute or the candidate can produce a fitness certificate from any Civil Hospital. The doctor available at the Institute may ask the candidate to undergo further tests if required. JOINING PROCEDURE Joining process involves the following: 1. Collection of primary details in the prescribed form, ‘Candidate’s Statement & Declaration’. 2. Document of the following certificates and testimonial submitted by the candidate will be verified with the originals. a. Mark sheets from 10th to last qualified exam (educational & professional) b. Passing certificates of exams c. Birth certificate d. Present and Permanent address proof e. Relieving letter and latest salary slip of the last organization served f. Medical certificate for fitness g. Copy of Aadhar card / PAN card / passport / driving license / election identity card / any other photo identity proof issued by State/Central Government. h. Two photographs 3. Collection of joining report. 4. Issuing of ‘Joining Memorandum’. 5. Formal introduction to Associate Vice President - HR and announcement to other concerned departments about the candidate’s appointment. 6. Issuing I-card. PAYMENT OF SALARY Salary of employees will become due and payable on the last working day of each month. DEDUCTION FROM SALARY Deductions in salary may be made for coming late to work, unauthorised absence, against fines imposed etc. Such recovery shall be in conformity with the provisions of the Payment of Salary Act, 1936. IDENTITY CARD 1. Every employee will be provided with an identity card which, besides the name of the employee, will have an employee code number, photograph, and other relevant personal details. 2. Identity cards are not transferable and should be carried by the employee whenever he/she is on Institute’s duty either inside or outside the premises of the Institute 12 IIMA HR Policy Manual 2023 3. Employee shall present the identity card for inspection to any person so authorised to inspect by the Institute. 4. Loss of the identity card should be immediately reported so that any possible misuse can be avoided and a replacement card issued. Loss of I-card on more than 2 occasions shall be viewed as a misconduct on the part of the employee. 5. Employees are required to surrender their identity cards, badge, etc. on leaving the service of the Institute. Surrender of I-card is a requirement for final settlement of dues. 6. The Institute shall keep a record of all identity card, badges issued and returned and shall carry out a surprise check of the same at least once every quarter. 7. For campus resident identity cards are issued to their family member and domestics servants for security purpose. RECRUITMENT CRITERIA FOR VARIOUS POSTS (BUT NOT ALL) AT IIMA* Sr. No Name of the Position Qualification Experience Age Nature of Duty 1 Chief Administrative Officer Master’s Degree with Degree/Dip in Management/ Engineering or Finance Degree Minimum 20 years experience in Sr. Administration position 45-50 years General Administration, Finance, Engineering & Estate Maintenance. Secretary to Board of Governance 2 Chief Financial Officer Chartered Accountant (CA) from India. Additionally, MBA in Finance will be preferred qualification. At least 20 years in Accounts, Finance & Controllers functions Max. 55 years To provide overall strategic leadership and play a key role in building and improving the financial management capability of IIMA, with the priority objective of supporting the governance mechanism of the organization 3 Chief Operating Officer – Executive Education Postgraduates, preferably an MBA from a reputed institute At least 15 years’ experience of which at least five years should have been in a senior position Max. 55 years The person will lead IIMA’s engagement with working professionals seeking management education through relationships with corporate L&D/ HR teams and directly with the professionals by highlighting IIMA’s high-quality executive education programme offerings. 4 Vice President – Centre for Digital Transformation Postgraduates, preferably an MBA from a reputed institute At least 15 years’ experience in the IT Industry of which at least five years should have been in a senior position Max. 55 years The person should be able to create and manage a digitally-enabled organization, meet the goals and objectives of the Centre. 13 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 5 Vice President / Associate Vice President – JSW School of Public Policy The person will be responsible to set up the management systems, program execution and brand development, and provide overall administrative leadership of the JSW School of Public Policy. 6 Vice President- IGPC MBA/ CA/ CFA / CAIA / master’s in economics or Public Policy Minimum 15 years of Professional experience Min. 40 years and Max 58 years Heading IGPC Office 7 Associate Vice President-HR Post-graduate degree in HRM or related fields. Minimum 20 years of experience with at least five years at senior management level. Max. 55 years To provide strategic directions and administrative support on HR dimensions 8 Associate Vice President- Corporate Relations Post graduates or Masters in any of these fields (Business Administration, Human Resources, Psychology, Sociology, Communication, Education and related fields). Minimum 10 years of post-qualification experience (may be in the areas of recruiter relationship building, placements, networking, corporate communications, marketing etc.), of which about 8 years must be in an overall supervisory position. Max. 55 years The person will be responsible to lead the outreach of the MBA programme for experienced professionals, their career development, and alumni connect initiatives. The role requires extensive traveling and networking with industry leaders and corporate heads across the globe to strengthen the PGPX recognition among recruiters, alumni network and also potential applicants. 9 Associate Vice President- Centre for Transportation and Logistics M.Tech/MBA (Ph.D. preferred) from a reputed institute in India (such as IITs/IIMs/IISc) or abroad. At least 15 years of experience in the transportation and/or logistics sector or a related sector. At least five years should have been in a senior management or leadership position (equivalent to CEO). Max. 55 years The person will be responsible for overall development, management, and growth of the Centre for Transportation and Logistics. 14 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 10 Associate Vice President - Alumni, Community Relations & Global Partnerships Post graduate in any discipline (equivalent to MBA) Minimum 20 years of professional experience, of which about 10 years must be in Relationship Management/ Corporate Affairs/Business Development. Max. 55 years To help build and manage relationships with alumni and entities external to the Institute including the community, corporates, educational institutions and state agencies 11 Associate Vice President- Executive Education MBA or equivalent master’s degree or higher At least 20 years’ experience of which at least five years’ experience should be related to designing, developing, marketing, and selling executive programs or professional services to corporate clients Max. 55 years Designing, developing, marketing, and selling executive programs or professional services to corporate clients 12 Associate Vice President – Engineering & Projects Full time Degree in Civil/ Electrical/ Mechanical and Post-Graduate degree in professional/ management field Minimum 20 years’ experience of which at least ten (10) years’ experience should be related to planning, finalizing, and executing large scale Civil, Electrical and HVAC projects. Max. 55 years To lead the team of following departments: 1.\t Civil Engineering 2.\t Electrical Engineering 3.\t Mechanical – HAVC and Water Supply 4.\t Maintenance 13 Associate Vice President- ADCLOD Post Graduate Degree in any Discipline but preferably in management, organisational behaviour, human resource management, strategic management or public administration. Minimum of 10 years of professional experience Maximum 55 years 5.\t Develop management systems, program execution and brand development, and provide overall administrative leadership to the newly established centre 15 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 14 AVP-Corporate Relations, MBA- PGPX Post graduate or Masters in any of these fields (Business Administration, HR, Psychology, Sociology, Communication, Education and related fields) Min 10 years of post-qualification experience Max 50 years Strengthen the corporate relations of the Institute and increase recruiter pool size by increasing MBA- PGPX brand awareness. 15 Associate Vice President, IT The candidate should have completed MCA or BE/BTech in Computer Engineering or Information Technology or equivalent degree from any reputed Institute. Minimum of 20 years of professional experience out of which 10 years must be in the field of ICT. 45-55 years Computer Centre administration 16 AVP-Arun Duggal ESG Centre for Res and Innovation Master’s degree or equivalent Min 10 years of post qualification experience. Max 45 years To oversee activities of the Centre, facilitate research, connect with stakeholders and increase visibility of the Centre. 17 AVP- Procurement Any Degree with Diploma in Materials Management. Master’s Degree in relevant field will be preferred 15 years of experience in materials/logistics management. Max 45 years To look after the Contracts, Stores and Purchase Department. 18 General Manager Master’s Degree with Degree/Dip in Management/ Engineering or Finance Degree/ 15 years’ experience in Sr. Administration positions Max 45 years Finance/Engineering/ Estate Maintenance and General Administration/ Public Relations and Media Handling 19 General Manager- Finance or General Manager- Accounts M.Com/MBA with CA/ICWA/Cost Accounting 15 years’ experience in Assistant General Manager/Sr. Manager level Max 45 years Finance and General Administration 20 General Manager- Ranking and Accreditation MBA/PG Degree 15 years experience Max 45 years Ability to understand the information needs of the organisation and lead the team in the rankings and accreditations for benchmarking purpose at large. 16 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 21 General Manager-BDC for DS&AI Master’s or Ph.D, specializing in data science and artificial intelligence Min 9 years of post-qualification experience Max 50 years To work closely with the industry and academic partners to drive the activities of the centre along with research aligned with the centre’s objectives. 22 GM-NSE Master’s degree in the areas related to Finance, Marketing, Economics, Organizational Behaviour, Cognitive Sciences with a focus on Behavioral Sciences. Ph.D/ FPM would be preferred. Min 10 years or more in any business. Max 45 years To oversee activities of the Centre, facilitate research, connect with stakeholders and increase visibility of the Centre. 23 Deputy Librarian Ph.D. or NET or SLET/SET qualified. First Class (60% or above) in MLISc or equivalent qualification. 18 years of relevant experience. Max 50 years Assisting the Librarian in overall supervision and management of all the sections / departments of the library. 24 Assistant General Manager – Placement Post graduates or Masters in Business Administration or Human Resources, Psychology or Sociology or Communication or Education etc. Minimum 10 years of experience post qualification Max 50 years Head the placement office and lead the initiatives for corporate outreach, career development of students, and alumni connect. 25 Assistant General Manager – HR Graduate with First Class and should have a full time MBA (HR) degree from reputed Institute with At least 10 years of post-qualification experience in the field of HR (Personnel, Pay Roll, Vigilance, Administration, Legal etc.) Department, of which about 8 years must be in an overall supervisory position. Max 50 years HR initiatives, Recruitment, Wage, Training & Development, Union related matters 17 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 26 Assistant General Manager – PGPX Relations Post graduates or Masters in any of these fields (Business Administration, Human Resources, Psychology, Sociology, Communication, and Education) with Minimum 10 years of post-qualification experience (may be in the areas of corporate work exposure - networking, corporate communications, marketing/ branding, etc.), of which about 8 years must be in an overall supervisory position. Max 50 years Lead marketing efforts for PGPX admission 27 Assistant General Manager- S&P Any Degree with Diploma in Materials Management 10 years experience in stores & purchase Max 45 years Procurement, stores and issue of materials 28 Assistant General Manager- Contracts A Post Graduate OR professional Chartered Accountant (CA) OR professional Cost Accountant (CMA) OR holding full time MBA (Finance) degree with first class from a reputed institute. Minimum 10 years of post-qualification professional experience in the field of Finance/ Accounts/ Audit/ Contracts/ Legal Departments, of which about 5 years must be in a senior position Max 50 years Contracts Management 29 AGM-SAP Bachelors or Master’s Degree preferably in Information Technology and Computer Science Minimum 10 years of experience in SAP with at least five years in project management role Max 40 years Managing SAP S/4 HANA, Managing Key Stakeholders, Support Vendor and ERP Users and maintain SAP System Performance, Security and Regular Updates. 30 Assistant General Manager - Electrical Diploma in Electrical Engineering plus Degree in Electrical Engineering OR full time Degree in Electrical Engineering Minimum ten (10) years of experience in electrical engineering for full time degree candidates and minimum twelve (12) years of experience for Diploma plus Degree candidates. Max. 50 To supervise in planning, directing, coordinating, and evaluating the campus/ township electrical field related development & maintenance 18 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 31 Assistant General Manager- Finance & Accounts Professional Chartered Accountant (CA) OR professional Cost Accountant (CMA) OR holding full time MBA (Finance) degree from a reputed institute. At least 10 years post qualification professional experience in the field of Finance/ Accounts/ Audit Departments, of which about 8 years must be in an overall supervisory position. Max 50 years Carry out all administrative functions of Finance and Accounts Department under the guidance and supervision of General Manager/Head. 32 Assistant General Manager - Contracts & Compliance M.Com/MBA with CA/ICWS/Cost Accounting. 10 years experience in Statutory compliance and accounts related work. Max 45 years Statutory Compliance related work and Accounting related work 33 Assistant General Manager – Hospitality Full time Graduation in any discipline plus Masters or PG Diploma in Management/ Catering/ Hospitality/Hotel industry recognized by AICTE/UGC Minimum 15 years of experience in Hospitality Industry Max 45 years Overall responsible for housekeeping of IMDC, Annex, allied facilities, reception etc. Also look after the F&B facilities. 34 Assistant General Manager - Civil Full time Degree in Civil Engineering Minimum 10 years of experience in Civil/Construction and related field Max 55 years To supervise in planning, directing, coordinating, and evaluating the campus/township civil works related development & maintenance 35 Assistant General Manager – Accounts M.Com/MBA with CA/ICWA/Cost Accounting. 10 years experience in Finance and Banking related work Max 45 years Finance & Banking related activities 36 Assistant General Manager-Estate Post-graduate or equivalent 10 years experience of estate maintenance function. Min 35 years Estate Maintenance, Security, Transport, Horticulture. 37 Assistant General Manager-Hindi Master’s degree in Hindi with English as Compulsory subject at graduate level. Minimum 10 years experience and through knowledge of government policies on Hindi Max 45 years Implementation of Official Language. 19 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 38 Assistant General Manager, JSW School of Public Policy Postgraduate degree in any discipline, but preferably in management, public policy or public administration from a reputed institution. Minimum 10 years of professional experience Max 45 years Provide administrative leadership to a newly established School of Public Policy. 39 Assistant General Manager- Communications Post graduate or equivalent degree At least 10 years’ experience in communications (preferably in the management education sector) or journalism Min 35 years External Public Relations, Administrative Functions 40 Medical Officer MBBS from recognized Medical Institution Minimum 3 years of service post completion of MBBS degree Max 45 years To provide medical services to the IIMA community 41 Manager – India Gold Policy Centre Post graduate in any discipline (equivalent to MBA) Minimum 5 years of professional experience. Max 45 years To look after day-to-day administrative activities of the Centre and to coordinate with different internal and external stakeholders 42 Manager – HR Post-Graduation/ Professional qualification preferably MBA (Human Resource Management) At least 5 years of post-qualification experience in Personnel/HR, Pay Roll, Vigilance, Administration, and Legal Department. Experience in PSU/ Government/ Autonomous Bodies or large Academic Institution is desirable. Min 30 Max 45 years HR initiatives, Recruitment, Wage, Training & Development, Union related matters 43 Manager-EEP MBA or equivalent 10 years experience, preferably a diploma in hotel management. Max 45 years Management of MDP & MDC 44 Accounts Manager M.Com. (Accountancy) or CA/Cost Accounting 5 years supervisory experience. Max 45 years Taxation/Finalisation of budget any other account/ finance related function. 20 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 45 Technical Manager (IT enabled services) Engineering Graduate minimum relevant experience of 5 years. Should have handled at least 2 – 3 large to medium sized Audio Video & CCTV Projects. Max 40 years Audio Video (AV) IP Based CCTV Surveillance System 46 Manager - Electrical Diploma in Electrical Engineering plus Degree in Electrical Engineering OR full time Degree in Electrical Engineering Minimum five years of experience Max 40 years To supervise in planning, directing, coordinating, and evaluating the campus/ township electrical field related development & maintenance 47 Manager - Civil Full time Diploma in Civil plus Degree in Civil Engineering OR full time Degree in Civil Engineering approved by UGC/ AICTE Minimum 5 years of experience Max 40 years To supervise in planning, directing, coordinating, and evaluating the campus/township civil works related development & maintenance 48 Manager - ICT Office Administration Degree in Computer Science or IT Min 5 years of professional experience of which at least two must be in the field of ICT Max 45 years Managing ICT Office Administration 49 Manager - Audio and Visual Degree in BE/B. Tech or Master in Computer Science Min 7 years of professional experience in Audio Visual Field Max 45 years Oversee and provide support and technical guidance to AV projects and coordinate for AV related events of the Institute. 50 Assistant Librarian Ph.D. or NET or SLET/SET qualified. First Class (60% or above) in MLISc or equivalent qualification. Overall 8 years of experience with 5 years or more in Pay Level 7 or higher in an academic library of repute. Max 40 years Library professional work and overall supervision of sections / departments of the library. 21 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 51 Programmes Manager, House Keeping Manager, Public Relations Manager, Admissions Manager Bachelor’s degree in relevant field. Preferably Post Graduate Degree At least 5 years experience in supervisory level Max 45 years Managing of various activities 52 Assistant Manager - Mechanical Diploma in Mechanical Engineering plus Degree in Mechanical Engineering OR full time Degree in Mechanical Engineering approved by UGC/ AICTE. About 5 years of experience in field of Mechanical Engineering Max 35 years To Supervise planning, directing, coordinating, and evaluating the campus / township mechanical field related development & maintenance. 53 Assistant Manager - Compliance Professional Chartered Accountant (CA). At least 5 years of post-qualification professional experience Max 35 years Compliance with Government regulations and Institute’s norms Vetting of agreements and MOUs with donors and collaborators Any other account/finance/ audit related function. 54 Assistant Manager - Hardware & Network B.Tech/B.E./M.C.A (Computer Science/ Information Technology/ Networking). Minimum of 5 years of professional experience in networking and field of ICT. Min 30 and max 40 years Coordinate and manage Network projects. Design, install, test, implement, document, support, and maintain network operating systems and services. 55 Assistant Manager - Server Administrator Graduate with Certifications in Microsoft Windows Server and LINUX Administration. VMWare certification can be an added advantage. At least 5 years experience Max 40 years Server administration 56 Assistant Manager - Software BE/B.Tech./MCA degree Minimum 3 years of relevant professional work experience. Max 35 years Programming, implementation, testing, and support of web-based projects 57 Assistant Manager - Editorial MA or a degree in Journalism At least 3 years experience Max 35 years Editing the Institute publications 22 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 58 Executive - Editorial MA or a degree in Journalism Some experience in editing Max 30 years Editing the Institute publications 59 Library Professional Assistant A Master degree in Library & Information Science (MLISc) (60% or above) Minimum two years’ relevant experience. Max 35 years Library professional work 60 Secretary to CAO Minimum post graduate in any discipline with minimum second class from any recognised university. At least 5 years experience Max 40 years Provide support to CAO in his various activities 61 Assistant Manager- Facility Office Bachelor’s degree Minimum 3 years of relevant experience in facility management Max 40 years Assisting the Facilities Manager for developing and implementing systems and procedures for smooth operations of facility management 62 Assistant Manager-EE (Marketing) Post Graduate in Management from a premier Institute Minimum 3 years’ experience Max 35 years Building a pipeline of Customised programmes, both short term and long term for companies / government across industries as well as functional areas in Executive Education 63 Assistant Manager - EE (eLearning) Post Graduate in Management from a premier Institute 3 years’ experience Max 35 years Handling programme promotion, programme execution and other programme related tasks. 64 Assistant Manager- Case Centre MBA or an equivalent Master’s degree At-least 3 years of relevant experience Max 35 years Support to case centre 65 Assistant Manager- S&P Any graduation with degree/diploma in Materials Management At least 3 years of relevant experience in materials/logistics management or stores management Max 35 years Stores & Purchase administration 23 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 66 Assistant Manager- Student Exchange Office Post Graduate in Management from a premier Institute Minimum 3 years’ experience Max 40 years Handling entire Students’ Exchange Office independently dealing with exchange of both, incoming as well as outgoing students, ensuring continuous development and expansion of the programme by addition of new prominent exchange partners. 67 Assistant Manager- Advisory Research & Conference Graduate in any discipline Minimum 3 years’ experience Max 40 years Organizing Advisory, Research, & Conference Services at IIMA. 68 Assistant Manager (Web) - Alumni Office Graduation Minimum 3 years of experience in the field of IT/ Computer/web. Max 45 years Assist Manager-Alumni Relations & Alumni office Officials. 69 SAP MM Consultant Graduate in any discipline. BE/B. Tech desired At least 2 end to end implementation in SAP MM (starting from requirement gathering till support) Max 40 years SAP Support 70 SAP HR Consultant Graduate in any discipline. BE/B. Tech desired At least 2 end to end implementation in SAP HR (starting from requirement gathering till support) Max 40 years SAP Support 71 SAP PS Consultant Graduate in any discipline. BE/B. Tech desired At least 2 end to end implementation in SAP PS (starting from requirement gathering till support) Max 40 years SAP Support 72 SAP FICO Consultant Graduate in any discipline. BE/B. Tech desired At least 2 end to end implementation in SAP FICO (starting from requirement gathering till support) Max 40 years SAP Support 24 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 73 Assistant Manager - Horticulturist Minimum B.Sc. or B.Tech. in Horticulture OR Agriculture Reasonably good and relevant experience in Landscape Development and Maintenance. Max 40 years Supervision of routine Landscape Development & Maintenance. 74 Assistant Manager - Communications Post-Graduate/ Masters in Journalism/ Diploma in Mass Communication/ Journalism. 2-4 years’ of experience Max 35 years Digital Marketing & Social Media, Content Writing 75 Assistant Manager - Company Secretary Graduates with CS qualified. 3-5 years of relevant experience. Max 40 years Day-to-day management of IIMA, including compliance with legal and statutory requirements 76 Assistant Manager- Programmes Minimum post graduate in management – MBA - (full time) with minimum second class from any recognised university. Minimum 3 years of relevant experience. Max 35 years Responsible for education programme revenues by building a pipeline of customised programmes, both short term and long term for companies / government across industries as well as functional areas. 77 Archivist Postgraduate diploma/ degree in Archives and Records Management, along with a master’s degree in any discipline or A master’s degree in library science with certification in archives management Min two years of work experience in an established archives. Max 40 years Implement IIMA’s archival policies. Collect, select, manage and preserve records (in any type of media) related to IIMA’s history and disseminate historical information about the Institute to larger community after approval. 78 Assistant Manager - Mail Administrator Minimum graduate (full time) with minimum second class from any recognised university. Minimum three years of relevant experience. Experience in Google Apps and G suite will be preferred Max 35 years Administers and maintains the organization’s email system i.e. Google mail, Google Apps and G suite. 25 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 79 Assistant Manager - Hindi Translator Master’s Degree in Hindi/Eng with Hindi/Eng as Optional subject at Degree Level or BA in Hindi/Eng as Optional subject Minimum 3 years experience in translation work. Excellent Communication skill in Hindi & English; computer skill Ma 30 years Translation of documents from English to Hindi, preparing documents, notes in Hindi 80 Executive - Help Desk Minimum graduate (full time) with minimum second class from any recognised university. Minimum three years of relevant experience. The candidate having Technical Certificate like CompTIA A+, N+ will be preferred. Max 35 years Serve as the first point of contact for computer users seeking technical assistance over the phone or email or chat. Should able to resolve 50% calls on phone. 81 Executive - Accounts Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience Max 30 years Accounts administration 82 Executive - Programme Coordinator Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience/ minimum one year of experience Max 30 years Handling programme promotion, programme execution and other programme related tasks. 83 Executive - Programme Associate MBA or an equivalent Master’s degree Minimum two years of relevant experience Max 30 years Handling programme promotion, programme execution and other programme related tasks. 84 Executive - Programme Coordinator (eLearning) Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience/ minimum one year of experience Max 30 years Handling programme promotion, programme execution and other programme related tasks. 85 Executive -Secretarial Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience Max 30 years To provide Secretarial assistance to Faculty members of the Institute in their day-to-day Administrative / Teaching/ Project work and provide interface with different facility providers of the Institute. 26 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 86 Executive - Marketing Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience/ minimum one year of experience Max 30 years Handling programme promotion, programme execution and other programme related tasks. 87 Executive - Client Accounts Full-time graduate degree in any discipline. Minimum three years of relevant experience Max 30 years Developing and sustaining client relationship 88 Executive - Marketing (ePGP) Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience/ minimum one year of experience Max 30 years Marketing / communications for the programme. 89 Executive - Marketing (PGPX) Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum of 3 years’ experience as an independent marketing research/ assistant of which minimum one year in any educational institute Max 35 years Marketing / communications for the programme 90 Executive (PGPX) Full-time graduate degree in any discipline / full-time post graduate degree in any discipline Minimum three years of relevant experience Max 35 years To assist the Programme Manager in all activities related to the office including programme administration including academics, outreach programmes, admissions and well-being of programme participants 91 Executive – PGP/Student Exchange MBA / M.Com. / M.A. or Bachelor 1-2 years’ experience Max 35 years Assisting in PGP/Student Exchange 92 Executive- Human Resource / Stores & Purchase/ House Keeping / Finance/ Accounts Graduate (full time) with first class from any recognised university or a post graduate (full time) with second class from any recognised university Minimum three years of relevant experience. Max 30 years Assisting in the concerned departments 27 IIMA HR Policy Manual 2023 Sr. No Name of the Position Qualification Experience Age Nature of Duty 93 Executive- IT (PGPX) BCA/MCA or related graduate/ post graduate degree in the field of computer science (full time) with first class from any recognised university. Minimum three (03) years of experience Max 30 years To execute the IT specialized work in coordination with the Computer Centre 94 Executive - Communications Department B.Com./B.B.A./M. Com. or equivalent Degree. 3 years of relevant experience Max 30 years Maintaining the office, taking campus visit registration and performing office functions. This person also serves as the primary source of information for walk-in and phone participants 95 Executive (Accreditation and Ranking) Post graduate in management (MBA) or in Statistics (M.Sc./ MA) with minimum second class from any recognised university Minimum three (03) years of relevant experience Max 30 years Administrative duties 96 HVAC Technician Diploma in Mechanical Engineering OR ITI HAVC minimum 5 years of experience in similar field. 40 AC Mechanic Work * The institute may change the recruitment criteria as and when it deemed so.",
    "structured_summary": "## Recruitment Policy\n### Eligibility Criteria\n\n* Sr. No | Name of the Position | Qualification | Experience | Age | Nature of Duty\n| --- | --- | --- | --- | --- |\n| 1 | Chief Administrative Officer | Master’s Degree with Degree/Dip in Management/Engineering or Finance Degree | Minimum 20 years experience in Sr. Administration position | 45-50 years | General Administration, Finance, Engineering & Estate Maintenance. |\n| 2 | Chief Financial Officer | Chartered Accountant (CA) from India. Additionally, MBA in Finance will be preferred qualification. | At least 20 years in Accounts, Finance & Controllers functions | Max. 55 years | To provide overall strategic leadership and play a key role in building and improving the financial management capability of IIMA, with the priority objective of supporting the governance mechanism of the organization |\n| 3 | Chief Operating Officer – Executive Education | Postgraduates, preferably an MBA from a reputed institute | At least 15 years’ experience of which at least five years should have been in a senior position | Max. 55 years | The person will lead IIMA’s engagement with working professionals seeking management education through relationships with corporate L&D/ HR teams and directly with the professionals by highlighting IIMA’s high-quality executive education programme offerings. |\n\n### Policy Rules & Clauses\n\n* Personal Interviews will be fixed as per the convenience of the interview panel members.\n* Candidates shortlisted for test/interview will be notified about it by an email.\n* The candidates will be directed to the venue for test/interview.\n* Forms that are needed to be filled like qualification details etc., will be done at this stage.\n* The interview structure may involve skill test, personal interview, and/or group discussion/ debate/quiz.\n* HR department will ensure that after the interview, each of the panel members provide their feedback in writing about the performance of the candidates.\n* HR will also play an active role in salary negotiation & fixation.\n* HR will collect feedback from references as needed.\n\n### Exceptions or Director’s Discretion\n\n* The institute may change the recruitment criteria as and when it deemed so.\n\n### Usage Conditions and Penalties\n\n* Deductions in salary may be made for coming late to work, unauthorised absence, against fines imposed etc.\n* Such recovery shall be in conformity with the provisions of the Payment of Salary Act, 1936.\n\n### Fee Tables or Annexures\n\n| Position | Qualification | Experience | Age | Nature of Duty |\n| --- | --- | --- | --- | --- |\n|... |... |... |... |... |\n\n### Conveyance Reimbursement\n\n* For Manager and above position, economy air travel fare will be reimbursed. The air travel fare should be the shortest distance.\n* Candidates called for the position at Level 6 to Level 9 will be reimbursed train fare for AC 3-Tier and for all below levels, it will be train fare for Sleeper Class. The train travel fare reimbursement will be for shortest route.\n* Request for reimbursement should be submitted in the prescribed form by the Candidate.\n\n### Final Selection\n\n* Final selection is made upon acceptance of the selection committee’s recommendations.\n* The selected candidate is offered the position subject to clearance of medical examination.\n\n### Medical Examination\n\n* For all the positions, the medical checkup can be performed by the doctor available at the Institute or the candidate can produce a fitness certificate from any Civil Hospital.\n* The doctor available at the Institute may ask the candidate to undergo further tests if required.\n\n### Joining Procedure\n\n1. Collection of primary details in the prescribed form, ‘Candidate’s Statement & Declaration’.\n2. Document of the following certificates and testimonial submitted by the candidate will be verified with the originals.\n\t* Mark sheets from 10th to last qualified exam (educational & professional)\n\t* Passing certificates of exams\n\t* Birth certificate\n\t* Present and Permanent address proof\n\t* Relieving letter and latest salary slip of the last organization served\n\t* Medical certificate for fitness\n\t* Copy of Aadhar card / PAN card / passport / driving license / election identity card / any other photo identity proof issued by State/Central Government\n\t* Two photographs\n3. Collection of joining report.\n4. Issuing of ‘Joining Memorandum’.\n5. Formal introduction to Associate Vice President - HR and announcement to other concerned departments about the candidate’s appointment.\n6. Issuing I-card.\n\n### Payment of Salary\n\n* Salary of employees will become due and payable on the last working day of each month.\n\n### Deduction from Salary\n\n* Deductions in salary may be made for coming late to work, unauthorised absence, against fines imposed etc.\n* Such recovery shall be in conformity with the provisions of the Payment of Salary Act, 1936.\n\n### Identity Card\n\n* Every employee will be provided with an identity card which, besides the name of the employee, will have an employee code number, photograph, and other relevant personal details.\n* Identity cards are not transferable and should be carried by the employee whenever he/she is on Institute’s duty either inside or outside the premises of the Institute\n* Employee shall present the identity card for inspection to any person so authorised to inspect by the Institute.\n* Loss of the identity card should be immediately reported so that any possible misuse can be avoided and a replacement card issued.\n* Loss of I-card on more than 2 occasions shall be viewed as a misconduct on the part of the employee.\n* Employees are required to surrender their identity cards, badge, etc. on leaving the service of the Institute. Surrender of I-card is a requirement for final settlement of dues.\n* The Institute shall keep a record of all identity card, badges issued and returned and shall carry out a surprise check of the same at least once every quarter.\n* For campus resident identity cards are issued to their family member and domestics servants for security purpose.\n\n### Recruitment Criteria for Various Posts (but not all)\n\n| Sr. No | Name of the Position | Qualification | Experience | Age | Nature of Duty |\n| --- | --- | --- | --- | --- | --- |\n| 1 |... |... |... |... |... |\n| 2 |... |... |... |... |... |\n| 3 |... |... |... |... |... |\n\n### Metadata\n\n* Chapter: Recruitment Policy\n* Subsection:",
    "metadata": {
      "type": "subtopic",
      "source": "hr_document",
      "page_range": "20-37",
      "chapter_id": "Chapter 3",
      "subtopic_title": "INTERVIEW & SELECTION PROCESS",
      "content_type": "policy",
      "chapter_title": "Recruitment Policy",
      "summary_stats": {
        "original_words": 5204,
        "summary_words": 1066,
        "compression_ratio": 0.2048424289008455
      }
    },
    "privacy_redacted": false,
    "processing_successful": true,
    "doc_id": "Recruitment_Policy_SCALES_OF_PAY"
  },
  {
    "original_content": "Chapter: Recruitment Policy\nSection: SCALES OF PAY\nContent: 1. The Pay Level for various administrative positions at the Institute are as follows: Designation Pay Level Vice President 13A Associate Vice President 13 General Manager/Dy. Librarian 12/12 AGP Assistant General Manager 11 Manager/Asst Librarian 10 Assistant Manager/Sr. Library Professional 6/7/8/9 Executive/Library Professional Assistant 5/4/2 Group D Staff 1/3 Other Staff Level 1 28 IIMA HR Policy Manual 2023",
    "structured_summary": "## SCALES OF PAY\n### Eligibility Criteria\nThe Pay Level for various administrative positions at the Institute are as follows:\n\n| Designation | Pay Level |\n| --- | --- |\n| Vice President | 13A |\n| Associate Vice President | 13 |\n| General Manager/Dy. Librarian | 12/12 AGP |\n| Assistant General Manager | 11 |\n| Manager/Asst Librarian | 10 |\n| Assistant Manager/Sr. Library Professional | 6/7/8/9 |\n| Executive/Library Professional Assistant | 5/4/2 |\n| Group D Staff | 1/3 |\n| Other Staff Level 1 | 28 |\n\n### Policy Rules & Clauses\nThe pay levels are as follows:\n\n* Vice President: 13A\n* Associate Vice President: 13\n* General Manager/Dy. Librarian: 12/12 AGP\n* Assistant General Manager: 11\n* Manager/Asst Librarian: 10\n* Assistant Manager/Sr. Library Professional: 6/7/8/9\n* Executive/Library Professional Assistant: 5/4/2\n* Group D Staff: 1/3\n* Other Staff Level 1: 28\n\n### Exceptions or Director’s Discretion\nNo exceptions.\n\n### Usage Conditions and Penalties\nNo penalties.\n\n### License or Housing Agreements\nNo license or housing agreements.\n\n### Fee Tables or Annexures\nNo fee tables or annexures.",
    "metadata": {
      "page_range": "37-38",
      "type": "subtopic",
      "content_type": "policy",
      "chapter_id": "Chapter 3",
      "source": "hr_document",
      "subtopic_title": "SCALES OF PAY",
      "chapter_title": "Recruitment Policy",
      "summary_stats": {
        "original_words": 67,
        "summary_words": 186,
        "compression_ratio": 2.7761194029850746
      }
    },
    "privacy_redacted": false,
    "processing_successful": true,
    "doc_id": "Recruitment_Policy_7TH_CPC_PAY_MATRIX"
  },
  {
    "original_content": "Chapter: Recruitment Policy\nSection: 7TH CPC PAY MATRIX\nContent: Pay Band 5200-20200 9300-34800 15600-39100 37400-67000 67000- 79000 75500- 80000 80000 90000 Grade Pay 1800 1900 2000 2400 2800 4200 4600 4800 5400 5400 6600 7600 8700 8900 10000 Level 1 2 3 4 5 6 7 8 9 10 11 12 13 13A 14 15 16 17 18 1 18000 19900 21700 25500 29200 35400 44900 47600 53100 56100 67700 78800 123100 131100 144200 182200 205400 225000 250000 2 18500 20500 22400 26300 30100 36500 46200 49000 54700 57800 69700 81200 126800 135000 148500 187700 211600 3 19100 21100 23100 27100 31000 37600 47600 50500 56300 59500 71800 83600 130600 139100 153000 193300 217900 4 19700 21700 23800 27900 31900 38700 49000 52000 58000 61300 74000 86100 134500 143300 157600 199100 224400 5 20300 22400 24500 28700 32900 39900 50500 53600 59700 63100 76200 88700 138500 147600 162300 205100 6 20900 23100 25200 29600 33900 41100 52000 55200 61500 65000 78500 91400 142700 152000 167200 211300 7 21500 23800 26000 30500 34900 42300 53600 56900 63300 67000 80900 94100 147000 156600 172200 217600 8 22100 24500 26800 31400 35900 43600 55200 58600 65200 69000 83300 96900 151400 161300 177400 224100 9 22800 25200 27600 32300 37000 44900 56900 60400 67200 71100 85800 99800 155900 166100 182700 10 23500 26000 28400 33300 38100 46200 58600 62200 69200 73200 88400 102800 160600 171100 188200 11 24200 26800 29300 34300 39200 47600 60400 64100 71300 75400 91100 105900 165400 176200 193800 12 24900 27600 30200 35300 40400 49000 62200 66000 73400 77700 93800 109100 170400 181500 199600 13 25600 28400 31100 36400 41600 50500 64100 68000 75600 80000 96600 112400 175500 186900 205600 14 26400 29300 32000 37500 42800 52000 66000 70000 77900 82400 99500 115800 180800 192500 211800 15 27200 30200 33000 38600 44100 53600 68000 72100 80200 84900 102500 119300 186200 198300 218200 16 28000 31100 34000 39800 45400 55200 70000 74300 82600 87400 105600 122900 191800 204200 17 28800 32000 35000 41000 46800 56900 72100 76500 85100 90000 108800 126600 197600 210300 18 29700 33000 36100 42200 48200 58600 74300 78800 87700 92700 112100 130400 203500 216600 19 30600 34000 37200 43500 49600 60400 76500 81200 90300 95500 115500 134300 209600 20 31500 35000 38300 44800 51100 62200 78800 83600 93000 98400 119000 138300 215900 21 32400 36100 39400 46100 52600 64100 81200 86100 95800 101400 122600 142400 22 33400 37200 40600 47500 54200 66000 83600 88700 98700 104400 126300 146700 29 IIMA HR Policy Manual 2023 Pay Band 5200-20200 9300-34800 15600-39100 37400-67000 67000- 79000 75500- 80000 80000 90000 Grade Pay 1800 1900 2000 2400 2800 4200 4600 4800 5400 5400 6600 7600 8700 8900 10000 Level 1 2 3 4 5 6 7 8 9 10 11 12 13 13A 14 15 16 17 18 23 34400 38300 41800 48900 55800 68000 86100 91400 101700 107500 130100 151100 24 35400 39400 43100 50400 57500 70000 88700 94100 104800 110700 134000 155600 25 36500 40600 44400 51900 59200 72100 91400 96900 107900 114000 138000 160300 26 37600 41800 45700 53500 61000 74300 94100 99800 111100 117400 142100 165100 27 38700 43100 47100 55100 62800 76500 96900 102800 114400 120900 146400 170100 28 39900 44400 48500 56800 64700 78800 99800 105900 117800 124500 150800 175200 29 41100 45700 50000 58500 66600 81200 102800 109100 121300 128200 155300 180500 30 42300 47100 51500 60300 68600 83600 105900 112400 124900 132000 160000 185900 31 43600 48500 53000 62100 70700 86100 109100 115800 128600 136000 164800 191500 32 44900 50000 54600 64000 72800 88700 112400 119300 132500 140100 169700 197200 33 46200 51500 56200 65900 75000 91400 115800 122900 136500 144300 174800 203100 34 47600 53000 57900 67900 77300 94100 119300 126600 140600 148600 180000 209200 35 49000 54600 59600 69900 79600 96900 122900 130400 144800 153100 185400 36 50500 56200 61400 72000 82000 99800 126600 134300 149100 157700 191000 37 52000 57900 63200 74200 84500 102800 130400 138300 153600 162400 196700 38 53600 59600 65100 76400 87000 105900 134300 142400 158200 167300 202600 39 55200 61400 67100 78700 89600 109100 138300 146700 162900 172300 208700 40 56900 63200 69100 81100 92300 112400 142400 151100 167800 177500",
    "structured_summary": "## Recruitment Policy\n### Eligibility Criteria\n* Pay Band 5200-20200: Level 1-10\n* Pay Band 9300-34800: Level 1-10\n* Pay Band 15600-39100: Level 1-10\n* Pay Band 37400-67000: Level 1-10\n* Pay Band 67000-79000: Level 1-10\n* Pay Band 75500-80000: Level 1-10\n* Pay Band 80000: Level 1-10\n* Pay Band 90000: Level 1-10\n\n### Policy Rules & Clauses\n* Grade Pay: 1800, 1900, 2000, 2400, 2800, 4200, 4600, 4800, 5400, 5400, 6600, 7600, 8700, 8900, 10000\n* Level: 1-13, 13A, 14, 15, 16, 17, 18, 23\n\n### Exceptions or Director’s Discretion\n* Overstay Charges: Not specified\n* Improper Use: Not specified\n* Director's Overrides: Not specified\n\n### Usage Conditions and Penalties\n* Not specified\n\n### License or Housing Agreements\n* Not specified\n\n### Fee Tables or Annexures\n| Pay Band | Level | Fee |\n| --- | --- | --- |\n| 5200-20200 | 1-10 | Not specified |\n| 9300-34800 | 1-10 | Not specified |\n| 15600-39100 | 1-10 | Not specified |\n| 37400-67000 | 1-10 | Not specified |\n| 67000-79000 | 1-10 | Not specified |\n| 75500-80000 | 1-10 | Not specified |\n| 80000 | 1-10 | Not specified |\n| 90000 | 1-10 | Not specified |",
    "metadata": {
      "source": "hr_document",
      "subtopic_title": "7TH CPC PAY MATRIX",
      "chapter_id": "Chapter 3",
      "content_type": "policy",
      "type": "subtopic",
      "page_range": "38-39",
      "chapter_title": "Recruitment Policy",
      "summary_stats": {
        "original_words": 693,
        "summary_words": 207,
        "compression_ratio": 0.2987012987012987
      }
    },
    "privacy_redacted": false,
    "processing_successful": true,
    "doc_id": "General_Conduct,_Ethics_&_Disciplinary_Action_COMMUNICATIONS_TO_THE_MEDIA"
  },
  {
    "original_content": "Chapter: General Conduct, Ethics & Disciplinary Action\nSection: COMMUNICATIONS TO THE MEDIA\nContent: 1. The Communication Department of the IIMA will manage all communications with the press, in coordination with Director. Direct interaction with the Press will be handled by the Director. All queries from the media either through their representatives or otherwise should be referred to the General Manager - Communications. 2. An  employee will deal directly with media on IIMA related matters, only after proper authorization to do so. 3. The  use of internet or any other social media to reveal sensitive information is not allowed.",
    "structured_summary": "## General Conduct, Ethics & Disciplinary Action\n### Communications to the Media\n\nThe Communication Department manages press interactions, coordinated with the Director. Direct press interactions are handled by the Director. Media queries should be referred to the General Manager - Communications.\n\n### Policy Rules & Clauses\n\n*   An employee can deal with media on IIMA matters after proper authorization.\n*   Using internet or social media to reveal sensitive information is not allowed.\n\n### Exceptions or Director’s Discretion\n\nNo specific exceptions are mentioned.\n\n### Usage Conditions and Penalties\n\n*   Unauthorized media interactions may result in disciplinary action.\n\n### Fee Tables or Annexures\n\nNo fee tables or annexures are mentioned.\n\n### Eligibility Criteria\n\nNo eligibility criteria are mentioned.\n\n### Director’s Overrides\n\nNo director overrides are mentioned.\n\n### Improper Use\n\n*   Using internet or social media to reveal sensitive information is not allowed.\n\n### Overstay Charges\n\nNo overstay charges are mentioned.\n\n### License or Housing Agreements\n\nNo license or housing agreements are mentioned.",
    "metadata": {
      "source": "hr_document",
      "chapter_id": "Chapter 5",
      "subtopic_title": "COMMUNICATIONS TO THE MEDIA",
      "type": "subtopic",
      "content_type": "policy",
      "page_range": "55-55",
      "chapter_title": "General Conduct, Ethics & Disciplinary Action",
      "summary_stats": {
        "original_words": 98,
        "summary_words": 160,
        "compression_ratio": 1.6326530612244898
      }
    },
    "privacy_redacted": false,
    "processing_successful": true,
    "doc_id": "General_Conduct,_Ethics_&_Disciplinary_Action_PROTECTION_&_PROPER_USE_OF_IIMA_ASSETS"
  },
  {
    "original_content": "Chapter: General Conduct, Ethics & Disciplinary Action\nSection: PROTECTION & PROPER USE OF IIMA ASSETS\nContent: 1. All employees are expected to  be responsible and efficient in their use of IIMA’s assets. All assets of the Institute shall be used only for legitimate business purposes. 2. Theft, carelessness, and waste of resources will be viewed seriously. CHAPTER 5 GENERAL CONDUCT, ETHICS & DISCIPLINARY ACTION 46 IIMA HR Policy Manual 2023 DRUGS/SMOKING/ALCOHOL/WEAPONS 1. An employee taking drugs/consuming alcohol/smoking in office or found to possess weapons in office will be committing a disciplinary offence, which will be dealt with in accordance with the Institute’s Disciplinary Action Procedure. 2. An employee may be, on reasonable suspicion, asked to undergo drug/alcohol testing. Refusal to comply with the directive may result in termination of the employee’s services with the Institute. CONDUCT RULES [DO’S] – EVERY EMPLOYEE SHALL 1. Maintain absolute integrity at all times. 2. Maintain absolute devotion to duty at all times. 3. Maintain independence and impartiality in the discharge of duties. 4. Maintain a responsible and decent standard of conduct in private life. 5. Render prompt and courteous service to the public. 6. Observe proper decorum on and off the workplace. 7. Promptly report to superiors civil/criminal procedures against him/her, if any, in a Court of Law and the circumstances connected therewith. 8. Keep away from demonstrations organised by political parties. 9. Maintain political neutrality in their official dealings involving the Institute. 10.\t Avoid habitual indebtedness or insolvency. 11.\t Act in accordance with Institute policies 12.\t  Mainting courtesy while dealing with the general public [DON’TS] NO EMPLOYEE SHALL 1. Indulge in acts detrimental to the interest of IIMA. 2. Adopt dilatory tactics in his/her dealings with the public. 3. Practice untouchability. 4. Associate himself/herself with any banned organizations. 5. Join any association or demonstration whose objects or activities are prejudicial to the interest of the sovereignty and integrity of India, public order or morality. 6. Accept lavish or frequent hospitality from any individual, industrial or commercial firms, organizations, etc., having official dealings with him/her. 7. Lend money to or borrow money from or deposit money as a member or agent, with any person, firm or private company with whom he/she is likely to have official dealings. 8. Approach subordinates for standing surety for loans taken from private sources either by him/her, relations, or friends. 9. Appear in public place in a state of intoxication. 47 IIMA HR Policy Manual 2023 10.\t Indulge in any act of sexual harassment of any kind at workplace. 11.\t Enter into any private correspondence with Foreign Embassies or Missions/High Commissions. 12.\t Willful insubordination or disobedience, whether alone or in combination with others to any lawful and reasonable order of a supervisor. 13.\t Theft, or dishonesty in connection with the Institute’ activities or property. 14.\t Willful damage to or loss of the Institute’s goods or property. 15.\t Taking or giving bribes or any illegal gratification. 16.\t Habitual late attendance. 17.\t Habitual breach of any law applicable at the Institute. 18.\t Habitual negligence or neglect of work. 19.\t Frequent repetition of any misconduct or omission. 20.\t Striking work or inciting others to strike work. 21.\t Contravention of the provisions of any law, or rule having the    force of law. 22.\t Acting in a manner prejudicial to the interests of the Institute. 23.\t Drunkenness or riotous or disorderly or indecent behaviour in the premises of the Institute or outside such premises where such behavior is related to or connected with the employment. 24.\t Gambling within the premises of the office or other place of work, where it is prohibited. 25.\t Smoking within the premises of the Office or other place of work, where it is prohibited. 26.\t Collection, without the permission of the competent authority, of any money (within the premises of the Institute) except as sanctioned by any law of the land for the time being in force or rules of the Institute. 27.\t Sleeping while on duty. 28.\t Commission of any act which amounts to a criminal offence involving moral turpitude. 29.\t Absence from the employee’s appointed place of work without permission or sufficient cause. 30.\t Commission of any act subversive of discipline or good behavior. 31.\t Willful and prolonged absence from duty without reasonable cause. 32.\t Neglect of his/her spouse and family in a manner unbecoming of an employee of the Institute. 33.\t Failure to maintain a responsible and decent standard of conduct in private life, thereby bringing discredit to the Institute. 34.\t Having obtained an advance from the Institute for a specific purpose such as building a house, purchase of conveyance, leave travel or for any other declared purpose, but not utilizing the advance for the intended purpose within the period specified and diverting the money for any other use. 35.\t Any act unbecoming of an employee of the Institute. 36.\t Assaulting or abusing or insulting any of the officers or employees of the Institute within the premises of office or other place of work or outside. 48 IIMA HR Policy Manual 2023 37.\t Interference in the work of other employees. 38.\t Approaching higher authorities direct or through other persons for promotion or any other personal favor or gain except through proper channel. 39.\t Writing of anonymous or pseudonymous letter criticizing the Management or any other Manager/ employee of the Institute. 40.\t Spreading false rumors or giving false information or making defamatory statements (written or oral) which tend to bring the Management or its Managers into disrepute. 41.\t Carrying on money-lending, or any other private business. 42.\t Willful failure to appear before Medical Board, when called upon to do so. 43.\t Abetment of or attempt at abetment of any act which amounts to misconduct.",
    "structured_summary": "## General Conduct, Ethics & Disciplinary Action\n### Protection & Proper Use of IIMA Assets\n\n* All employees are responsible for using IIMA's assets for legitimate business purposes.\n* Theft, carelessness, and waste of resources will be viewed seriously.\n\n### Conduct Rules & Clauses\n\n* **DO'S**\n  * Maintain integrity and devotion to duty\n  * Maintain independence and impartiality\n  * Maintain a responsible standard of conduct in private life\n  * Render prompt and courteous service to the public\n  * Observe proper decorum on and off the workplace\n  * Promptly report to superiors on civil/criminal procedures\n  * Keep away from political demonstrations\n  * Maintain political neutrality in official dealings\n  * Avoid habitual indebtedness or insolvency\n  * Act in accordance with Institute policies\n  * Maintain courtesy while dealing with the general public\n* **DON'TS**\n  * Indulge in acts detrimental to IIMA's interest\n  * Adopt dilatory tactics with the public\n  * Practice untouchability\n  * Associate with banned organizations\n  * Join associations or demonstrations prejudicial to India's sovereignty, public order, or morality\n  * Accept lavish or frequent hospitality from individuals with official dealings\n  * Lend or borrow money from individuals with official dealings\n  * Appear in public in a state of intoxication\n  * Indulge in sexual harassment\n  * Enter into private correspondence with Foreign Embassies or Missions/High Commissions\n  * Willful insubordination or disobedience to lawful orders\n  * Theft or dishonesty in connection with Institute activities or property\n  * Willful damage to or loss of Institute's goods or property\n  * Taking or giving bribes or illegal gratification\n  * Habitual late attendance\n  * Habitual breach of applicable laws\n  * Habitual negligence or neglect of work\n  * Frequent repetition of misconduct or omission\n  * Striking work or inciting others to strike work\n  * Contravention of laws or rules having the force of law\n  * Acting in a manner prejudicial to IIMA's interests\n  * Drunkenness or riotous behavior in Institute premises or outside\n  * Gambling within Institute premises or other workplaces\n  * Smoking within prohibited workplaces\n  * Collection of money without permission\n  * Sleeping while on duty\n  * Commission of acts involving moral turpitude\n  * Absence from appointed workplace without permission or sufficient cause\n  * Commission of acts subversive of discipline or good behavior\n  * Willful and prolonged absence from duty\n  * Neglect of spouse and family in a manner unbecoming of an employee\n  * Failure to maintain a responsible standard of conduct in private life\n  * Having obtained an advance for a specific purpose and diverting the money\n  * Any act unbecoming of an employee\n  * Assaulting or abusing or insulting Institute officers or employees\n  * Interference in other employees' work\n  * Approaching higher authorities for personal favors or gain\n  * Writing anonymous or pseudonymous letters criticizing Management or employees\n  * Spreading false rumors or giving false information\n  * Carrying on private business\n  * Willful failure to appear before Medical Board\n  * Abetment of or attempt at abetment of misconduct\n\n### Exceptions or Director’s Discretion\n\n* An employee taking drugs/consuming alcohol/smoking in office or found to possess weapons in office will be committing a disciplinary offence.\n\n### Usage Conditions and Penalties\n\n* Refusal to comply with drug/alcohol testing may result in termination of services.\n* Theft, carelessness, and waste of resources will be viewed seriously.\n\n### Fee Tables or Annexures\n\n* Not provided in the original content.\n\n### License or Housing Agreements\n\n* Not provided in the original content.\n\nNote: The output has been compressed to approximately 50% of the original content length while preserving all factual content, legal clauses, logic structures, and procedures.",
    "metadata": {
      "chapter_id": "Chapter 5",
      "type": "subtopic",
      "chapter_title": "General Conduct, Ethics & Disciplinary Action",
      "page_range": "55-58",
      "content_type": "policy",
      "source": "hr_document",
      "subtopic_title": "PROTECTION & PROPER USE OF IIMA ASSETS",
      "summary_stats": {
        "original_words": 947,
        "summary_words": 586,
        "compression_ratio": 0.6187961985216474
      }
    },
    "privacy_redacted": false,
    "processing_successful": true,
    "doc_id": "General_Conduct,_Ethics_&_Disciplinary_Action_EMPLOYEE_ARRESTED_FOR_CRIMINAL_OFFENCE"
  }
]